<a href="https://colab.research.google.com/github/kzengg/Project-2/blob/main/Project_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

#Data Set 1

**Source:** https://www.kaggle.com/datasets/karthikbhandary2/property-rentals

**Description:** This data set contains data on different properties. It includes details about each property rented, as well as the price charged per night. It includes 9 columns.

**Target:** Price per night

**Classification/Regression:** Regression

**Features:** 5

**# of Rows:** 2222

**Possible Challenges:** Majority of the data is skewed towards 4 property types.

In [ ]:
dataset1 = 'https://docs.google.com/spreadsheets/d/e/2PACX-1vQklOtJEwS6tKqnELsZLnmHyHf9l3zakWMlWR5A3_xFaxjJdlT5WjpocMv2Mhay5pxrSX3LFF6aRND7/pub?output=csv'

In [ ]:
df = pd.read_csv(dataset1)
df.head()

,id,latitude,longitude,property_type,room_type,bathrooms,bedrooms,minimum_nights,price
0,958,37.76931,-122.43386,Apartment,Entire home/apt,1.0,1.0,1,$170.00
1,3850,37.75402,-122.45805,House,Private room,1.0,1.0,1,$99.00
2,5858,37.74511,-122.42102,Apartment,Entire home/apt,1.0,2.0,30,$235.00
3,7918,37.76669,-122.45250,Apartment,Private room,4.0,1.0,32,$65.00
4,8142,37.76487,-122.45183,Apartment,Private room,4.0,1.0,32,$65.00

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2222 entries, 0 to 2221
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              2222 non-null   int64
 1   latitude        2222 non-null   float64
 2   longitude       2222 non-null   float64
 3   property_type   2222 non-null   object
 4   room_type       2222 non-null   object
 5   bathrooms       2211 non-null   float64
 6   bedrooms        2221 non-null   float64
 7   minimum_nights  2222 non-null   int64
 8   price           2222 non-null   object
dtypes: float64(4), int64(2), object(3)
memory usage: 156.4+ KB

In [ ]:
df['property_type'].value_counts()

Apartment             919
House                 637
Condominium           255
Guest suite           177
Loft                   50
Townhouse              47
Hotel                  41
Hostel                 22
Serviced apartment     20
Bed and breakfast      20
Guesthouse             12
Boutique hotel         10
Bungalow                6
Cottage                 5
Other                   1
Name: property_type, dtype: int64

#Data Set 2

**Source:** https://www.kaggle.com/datasets/shwetabh123/mall-customers

**Description:** This data set contains data on different customer spending at a mall. It includes details about the gender, age, anual income and spending score.

**Target:** Spending Score

**Classification/Regression:** Regression

**Features:** 3

**# of Rows:** 200

**Possible Challenge:** Data set is small and data is not very balanced. (slight more female)

In [ ]:
dataset2 = 'https://docs.google.com/spreadsheets/d/e/2PACX-1vRome0-r1wm2PSzFY-OU3wqIsrJyIfUOeT9HUL-i3QowURMJ42Bhufdl-Bdewz04PjUqd2lpzYz4Yy3/pub?output=csv'

In [ ]:
df = pd.read_csv(dataset2)
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [ ]:
df['Genre'].value_counts()

Female    112
Male       88
Name: Genre, dtype: int64